app/workers/daily_digest_worker.rb

  def perform
    User.find_each do |user|
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1000]]