app/views/actors/show.html.erb

SELECT "films".* FROM "films" INNER JOIN "actors_films" ON "films"."id" = "actors_films"."film_id" WHERE "actors_films"."actor_id" = $1  [["actor_id", 1]]
---
  <ul>
    <% @actor.films.each do |role| %>