app/views/films/_activity.html.erb

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 ORDER BY "comments"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 3]]
---
<h2>Last activity:</h2>
<% current_user.comments.sort_by{|t| - t.created_at.to_i}.first(3).each do |comment|  %>

SELECT  "albums".* FROM "albums" WHERE "albums"."user_id" = $1 ORDER BY "albums"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 3]]
---
<% end %>
<% current_user.albums.sort_by{|t| - t.created_at.to_i}.first(3).each do |album| %>