app/views/films/_favorites.html.erb


<% current_user.favorites.each do |favorite| %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]

<h2>Albums: <%= link_to "Create your album",  new_album_path, class:"btn btn-success" %></h2>
<% Album.where(user_id: current_user).each do |s| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = $1  [["user_id", 1]]