app/views/films/index.html.erb

<h1 class="text-center"><%= t('film.all') %></h1>
---
SELECT "films".* FROM "films" ORDER BY cached_votes_up DESC

<p style="font-size: 16px" class="text-center">Popular franchises:
  <% Franchise.where(display_in_navbar:true).each do |f| %>
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."display_in_navbar" = $1  [["display_in_navbar", true]]