app/views/films/show.html.erb

SELECT "actors".* FROM "actors" INNER JOIN "actors_films" ON "actors"."id" = "actors_films"."actor_id" WHERE "actors_films"."film_id" = $1  [["film_id", 1]]
---
<div class="boxsize">
      <% @film.actors.each do |actor| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."film_id" = $1  [["film_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."film_id" = $1  [["film_id", 1]]
---

<h2 class="text-center"><%= @film.reviews.count %> Reviews from professionals, average rating of film: <strong style="color:red"><%= @film.reviews.average('rating') %></strong> </h2>