app/views/albums/new.html.erb


  <% current_user.favorites.each do |item| %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]