app/views/albums/show.html.erb

<% @album.favorites_id.each do |f| %>
  <% Film.where(name: f).each do |s| %>
---
SELECT "films".* FROM "films" WHERE "films"."name" = $1  [["name", "["]]