app/helpers/username_helper.rb

  def help(id)
    User.find(id).username
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def helpimg(id)
    url = User.find(id).avatar.url
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]