app/views/posts/index.html.erb

        <p class="card-text"><%= truncate(post.content, length: 45) %></p>
        <p><small><%=t('posts.tags') %>: <%= raw post.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %></small></p>
---
SELECT "posts".* FROM "posts"