app/controllers/actors_controller.rb

INSERT INTO "actors" ("name", "dataroz", "description", "created_at", "updated_at", "avtor") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    form_params = params.require(:actor).permit(:name, :dataroz, :description, :avtor)
    actor = Actor.create form_params

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @actor = Actor.find(params[:id])

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "films".* FROM "films" INNER JOIN "actors_films" ON "actors_films"."film_id" = "films"."id" INNER JOIN "actors" ON "actors"."id" = "actors_films"."actor_id" WHERE "films"."id" = $1  [["id", 1]]
---
  def show
    @actor = Actor.find(params[:id])
    @films = Film.all - @actor.films

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "actors" SET "dataroz" = $1, "updated_at" = $2 WHERE "actors"."id" = $3  [["dataroz", "1992-03-18"], ["updated_at", "2019-08-13 11:19:36.990791"], ["id", 2]]
---
  def update
    form_params = params.require(:actor).permit(:name, :dataroz, :description, :avtor)
    actor = Actor.find(params[:id])
    actor.update_attributes form_params

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    actor = Actor.find(params[:id])

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "films" INNER JOIN "actors_films" ON "films"."id" = "actors_films"."film_id" WHERE "actors_films"."actor_id" = $1 AND "films"."id" = $2 LIMIT $3  [["actor_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def add_film
    film_params = params.require(:film).permit(:id)
    actor = Actor.find(params[:id])
    film = Film.find(film_params[:id])
    actor.films << film unless actor.films.include? film

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def remove_film
    actor = Actor.find(params[:id])
    film = Film.find(params[:film_id])