app/controllers/albums_controller.rb

INSERT INTO "albums" ("name", "favorites_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "star"], ["favorites_id", "[\"Star Wars 7\", \"Roque One\"]"], ["user_id", 1], ["created_at", "2019-08-08 14:33:24.465865"], ["updated_at", "2019-08-08 14:33:24.465865"]]
INSERT INTO "albums" ("name", "favorites_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "all"], ["favorites_id", "[\"Roque One\", \"John Wick 3\", \"Star Wars 7\"]"], ["user_id", 1], ["created_at", "2019-08-13 07:44:33.147206"], ["updated_at", "2019-08-13 07:44:33.147206"]]
---
  def create
    @album = Album.create(album_params)
    @album.user_id = current_user.id
    if @album.save