app/controllers/comments_controller.rb

  def create
    @comment = @commentable.comments.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
---
INSERT INTO "comments" ("body", "commentable_type", "commentable_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Nice Film!"], ["commentable_type", "Film"], ["commentable_id", 1], ["user_id", 1], ["created_at", "2019-08-12 10:24:46.114728"], ["updated_at", "2019-08-12 10:24:46.114728"]]

  def find_commentable
    @commentable = Comment.find_by_id(params[:comment_id]) if params[:comment_id]
    @commentable = Film.find_by_id(params[:film_id]) if params[:film_id]
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]