app/controllers/favorites_controller.rb

  def update
    favorite = Favorite.where(film: Film.find(params[:film]), user: current_user)
    if favorite.blank?
      Favorite.create(film: Film.find(params[:film]), user: current_user)
      @favorite_exists = true
    else
      favorite.destroy_all
      @favorite_exists = false
    end
      redirect_to film_path(id: Film.find(params[:film]))
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."film_id" = $1 AND "favorites"."user_id" = $2 LIMIT $3  [["film_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "favorites" WHERE "favorites"."film_id" = $1 AND "favorites"."user_id" = $2 LIMIT $3  [["film_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."film_id" = $1 AND "favorites"."user_id" = $2 LIMIT $3  [["film_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."film_id" = $1 AND "favorites"."user_id" = $2  [["film_id", 1], ["user_id", 1]]
INSERT INTO "favorites" ("film_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["film_id", 1], ["user_id", 2], ["created_at", "2019-08-14 09:10:14.736888"], ["updated_at", "2019-08-14 09:10:14.736888"]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 2]]