app/controllers/films_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
---
  def show
    @favorite_exists = Favorite.where(film: @film, user: current_user) == [] ? false : true