app/controllers/films_controller.rb

  def index
   # search = params[:term].presence
    #@films = if search
            #   Film.search(search)
            # else
    @films =  Film.all.order("cached_votes_up DESC")
    if params.key?(:franchise)
    @films =  Film.joins(:franchise).where(franchises: {name: params[:franchise]})
---
SELECT "films".* FROM "films" INNER JOIN "franchises" ON "franchises"."id" = "films"."franchise_id" WHERE "franchises"."name" = $1  [["name", "Harry Potter"]]

  def show
    @favorite_exists = Favorite.where(film: @film, user: current_user).presence
    @actors = Actor.where('id NOT IN (?)',Actor.joins(:actors_films).where(actors_films: { film_id: params[:id]}).uniq)
---
SELECT "films".* FROM "films" INNER JOIN "actors_films" ON "actors_films"."film_id" = "films"."id" WHERE "actors_films"."actor_id" = $1  [["actor_id", 2]]
SELECT "actors".* FROM "actors" INNER JOIN "actors_films" ON "actors_films"."actor_id" = "actors"."id" WHERE "actors_films"."id" != $1  [["id", 1]]

  def update
    @film.update_attributes(film_params)
---
UPDATE "films" SET "cached_votes_up" = $1, "cached_votes_down" = $2, "cached_votes_score" = $3, "cached_weighted_score" = $4, "cached_weighted_average" = $5, "updated_at" = $6 WHERE "films"."id" = $7  [["cached_votes_up", 1], ["cached_votes_down", 0], ["cached_votes_score", 1], ["cached_weighted_score", 1], ["cached_weighted_average", 1.0], ["updated_at", "2019-08-12 08:58:15.719685"], ["id", 4]]

  def actor_find
    @actor = Actor.find(params[:actor_id])
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]