app/controllers/films_controller.rb

SELECT "films".* FROM "films" ORDER BY cached_votes_up DESC
SELECT  "franchises".* FROM "franchises" WHERE "franchises"."name" = $1 LIMIT $2  [["name", "Star Wars"], ["LIMIT", 1]]
SELECT "films".* FROM "films" WHERE "films"."franchise_id" = $1  [["franchise_id", 2]]
---
  def index
    search = params[:term].present? ? params[:term] : nil
    @films = if search
               Film.search(search)
             else
               @films = Film.all.order("cached_votes_up DESC")
             end
    if params.key?(:franchise)
    @franchise = Franchise.find_by_name(params[:franchise])
    @films = Film.where(franchise: @franchise)

SELECT "films".* FROM "films" ORDER BY cached_votes_up DESC
---
  def autocomplete
    render json: Film.search(params[:query], {
        fields:['name','time_create'],
        match: :word_start,
        limit: 10,
        load: false,
        misspellings: {below: 5}
    }).map(&:name)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."film_id" = $1 AND "favorites"."user_id" = $2  [["film_id", 1], ["user_id", 1]]
SELECT "actors".* FROM "actors" INNER JOIN "actors_films" ON "actors"."id" = "actors_films"."actor_id" WHERE "actors_films"."film_id" = $1  [["film_id", 1]]
---
  def show
    @favorite_exists = Favorite.where(film: @film, user: current_user) != []
    @actors = Actor.all - @film.actors

UPDATE "films" SET "franchise_id" = $1, "picture" = $2, "updated_at" = $3 WHERE "films"."id" = $4  [["franchise_id", 4], ["picture", "[\"[\\\"star_wars.jpg\\\", \\\"star1.jpg\\\", \\\"star2.jpg\\\", \\\"star3.jpeg\\\"]\"]"], ["updated_at", "2019-08-08 14:28:28.359015"], ["id", 1]]
---
  def create
    @film = Film.create(film_params)
    if @film.save

UPDATE "films" SET "producer" = $1, "updated_at" = $2 WHERE "films"."id" = $3  [["producer", "Devise man"], ["updated_at", "2019-08-12 11:43:46.094572"], ["id", 1]]
---
  def update
    @film.update_attributes(film_params)

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  1 AS one FROM "actors" INNER JOIN "actors_films" ON "actors"."id" = "actors_films"."actor_id" WHERE "actors_films"."film_id" = $1 AND "actors"."id" = $2 LIMIT $3  [["film_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def add_actor
    film = Film.find(params[:id])
    actor = Actor.find(params[:actor_id])
    film.actors << actor unless film.actors.include? actor

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 ORDER BY "films"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def remove_actor
    film = Film.find(params[:id])
    actor = Actor.find(params[:actor_id])

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 ORDER BY "films"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_film
    @film = Film.where(id: params[:id]).first