app/controllers/franchises_controller.rb

  def index
    @franchises = Franchise.all
---
SELECT "franchises".* FROM "franchises"

  def show
    @franchise = Franchise.find(params[:id])
    @films = Film.where(franchise_id: @franchise.id)
---
SELECT  "franchises".* FROM "franchises" WHERE "franchises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "films".* FROM "films" WHERE "films"."franchise_id" = $1  [["franchise_id", 3]]

  def create
    @franchise = Franchise.new(category_params)
    if @franchise.save
---
INSERT INTO "franchises" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Serials"], ["description", "asdasdasdasd"], ["created_at", "2019-08-08 14:27:37.893574"], ["updated_at", "2019-08-08 14:27:37.893574"]]