app/controllers/posts_controller.rb

  def index
    params[:tag] ? @posts = Post.tagged_with(params[:tag]) : @posts = Post.all
---
SELECT "posts".* FROM "posts"
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN ($1, $2, $3, $4)  [["id", 2], ["id", 3], ["id", 1], ["id", 4]]

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "avatars") VALUES ($1, $2, $3, $4, $5) RETURNING "id"